yahoo_scraping/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions"
SELECT COUNT(*) FROM "auctions"
---
  def index
    @auctions = Auction.all
    @auctions_count = @auctions.count

SELECT COUNT(*) FROM "auctions"
---
  def new
    @auction = Auction.new
    @auctions_count = Auction.all.count

INSERT INTO "auctions" ("url", "email", "proname", "price", "start", "finish", "bid_number", "remain_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    end

    #データベースにURLとメールアドレスを保存する
    if @auction.save

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "auctions" WHERE "auctions"."id" = ?  [["id", 5]]
---
  def destroy
    @auction = Auction.find(params[:id])
    @auction.destroy